Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_16 (Conv2D)           (None, 48, 48, 32)        320       
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 48, 48, 64)        18496     
_________________________________________________________________
batch_normalization_20 (Batc (None, 48, 48, 64)        256       
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 24, 24, 64)        0         
_________________________________________________________________
dropout_20 (Dropout)         (None, 24, 24, 64)        0         
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 24, 24, 128)       204928    
_________________________________________________________________
batch_normalization_21 (Batc (None, 24, 24, 128)       512       
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 12, 12, 128)       0         
_________________________________________________________________
dropout_21 (Dropout)         (None, 12, 12, 128)       0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 12, 12, 512)       590336    
_________________________________________________________________
batch_normalization_22 (Batc (None, 12, 12, 512)       2048      
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 6, 6, 512)         0         
_________________________________________________________________
dropout_22 (Dropout)         (None, 6, 6, 512)         0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 18432)             0         
_________________________________________________________________
dense_12 (Dense)             (None, 256)               4718848   
_________________________________________________________________
batch_normalization_23 (Batc (None, 256)               1024      
_________________________________________________________________
dropout_23 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_13 (Dense)             (None, 512)               131584    
_________________________________________________________________
batch_normalization_24 (Batc (None, 512)               2048      
_________________________________________________________________
dropout_24 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_14 (Dense)             (None, 7)                 3591      
=================================================================
Total params: 5,673,991
Trainable params: 5,671,047
Non-trainable params: 2,944
_________________________________________________________________
