Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_24 (Conv2D)           (None, 48, 48, 32)        320       
_________________________________________________________________
conv2d_25 (Conv2D)           (None, 48, 48, 64)        18496     
_________________________________________________________________
batch_normalization_28 (Batc (None, 48, 48, 64)        256       
_________________________________________________________________
max_pooling2d_20 (MaxPooling (None, 24, 24, 64)        0         
_________________________________________________________________
dropout_28 (Dropout)         (None, 24, 24, 64)        0         
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 24, 24, 128)       204928    
_________________________________________________________________
batch_normalization_29 (Batc (None, 24, 24, 128)       512       
_________________________________________________________________
max_pooling2d_21 (MaxPooling (None, 12, 12, 128)       0         
_________________________________________________________________
dropout_29 (Dropout)         (None, 12, 12, 128)       0         
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 12, 12, 512)       590336    
_________________________________________________________________
batch_normalization_30 (Batc (None, 12, 12, 512)       2048      
_________________________________________________________________
max_pooling2d_22 (MaxPooling (None, 6, 6, 512)         0         
_________________________________________________________________
dropout_30 (Dropout)         (None, 6, 6, 512)         0         
_________________________________________________________________
conv2d_28 (Conv2D)           (None, 6, 6, 512)         2359808   
_________________________________________________________________
batch_normalization_31 (Batc (None, 6, 6, 512)         2048      
_________________________________________________________________
max_pooling2d_23 (MaxPooling (None, 3, 3, 512)         0         
_________________________________________________________________
dropout_31 (Dropout)         (None, 3, 3, 512)         0         
_________________________________________________________________
conv2d_29 (Conv2D)           (None, 3, 3, 512)         2359808   
_________________________________________________________________
batch_normalization_32 (Batc (None, 3, 3, 512)         2048      
_________________________________________________________________
max_pooling2d_24 (MaxPooling (None, 1, 1, 512)         0         
_________________________________________________________________
dropout_32 (Dropout)         (None, 1, 1, 512)         0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 512)               0         
_________________________________________________________________
dense_12 (Dense)             (None, 256)               131328    
_________________________________________________________________
batch_normalization_33 (Batc (None, 256)               1024      
_________________________________________________________________
dropout_33 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_13 (Dense)             (None, 512)               131584    
_________________________________________________________________
batch_normalization_34 (Batc (None, 512)               2048      
_________________________________________________________________
dropout_34 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_14 (Dense)             (None, 7)                 3591      
=================================================================
Total params: 5,810,183
Trainable params: 5,805,191
Non-trainable params: 4,992
_________________________________________________________________
